cases/plate/example/constant/solid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

1
(
    solid_to_fluid
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          690;
        startFace       2355;
        sampleMode      nearestPatchFaceAMI;
        sampleRegion    fluid;
        samplePatch     fluid_to_solid;
    }
)

// ************************************************************************* //
