cases/plate/example/0/fluid/U.liquid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/fluid";
    object      U.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0 0 0 );

boundaryField
{
    maxY
    {
        type            pressureInletOutletVelocity;
        phi             phi.liquid;
        value           uniform ( 0 0 0 );
        inletValue      uniform ( 0 0 0 );
    }
    walls
    {
        type            noSlip;
    }
    fluid_to_solid
    {
        type            noSlip;
    }
}


// ************************************************************************* //
