cases/plate/example/0/solid/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/solid";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 1153.15;

boundaryField
{
    solid_to_fluid
    {
        type            compressible::turbulentTemperatureTwoPhaseRadCoupledMixedBiot;
        value           uniform 1153;
        Tnbr		    T.gas;
        kappaMethod     solidThermo;
	    region		    solid;
        otherPhase      liquid;
	    qrNbr		none;
	    qr		none;
    }
}

// ************************************************************************* //
